Revit 2027 API
ParameterTypeId.AnalyticConstruction Property
 "Analytic Construction"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticConstruction { get; }
Public Shared ReadOnly Property AnalyticConstruction As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticConstruction {
	ForgeTypeId^ get ();
}
static member AnalyticConstruction : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace